{"HDFC bank": {"df_top3words": "{\"topic_id\":{\"0\":0,\"1\":1,\"2\":2,\"3\":3,\"4\":4},\"words\":{\"0\":\"time, \\ncall, \\nleave\",\"1\":\"credit, \\nday, \\nlate\",\"2\":\"call, \\ncharge, \\ncontact\",\"3\":\"credit, \\ntell, \\nmoney\",\"4\":\"item, \\ncredit, \\nreport\"}}", "tsne_df": "{\"tsne_x\":{\"0\":148.214263916,\"1\":-205.5663757324,\"2\":-255.8698425293,\"3\":180.8449401855,\"4\":122.944190979,\"5\":283.6568908691,\"6\":-55.5236968994,\"7\":386.1615905762,\"8\":17.7202949524,\"9\":77.826675415,\"10\":257.1173400879,\"11\":-22.7418842316,\"12\":-144.1133880615,\"13\":-85.2231521606,\"14\":-169.5519866943,\"15\":-362.1878356934},\"tsne_y\":{\"0\":315.997833252,\"1\":-44.3160324097,\"2\":155.0111236572,\"3\":-229.4902954102,\"4\":-47.9255599976,\"5\":-113.3115692139,\"6\":-77.8032531738,\"7\":42.8188514709,\"8\":-240.910446167,\"9\":123.2827529907,\"10\":167.7792205811,\"11\":248.3603515625,\"12\":-246.9445495605,\"13\":77.5746383667,\"14\":341.7324829102,\"15\":-95.6811828613},\"topic_num\":{\"0\":0,\"1\":0,\"2\":0,\"3\":0,\"4\":0,\"5\":2,\"6\":2,\"7\":0,\"8\":0,\"9\":0,\"10\":0,\"11\":0,\"12\":0,\"13\":0,\"14\":0,\"15\":0},\"doc_num\":{\"0\":0,\"1\":1,\"2\":2,\"3\":3,\"4\":4,\"5\":5,\"6\":6,\"7\":7,\"8\":8,\"9\":9,\"10\":10,\"11\":11,\"12\":12,\"13\":13,\"14\":14,\"15\":15}}", "df_dominant_topic": "{\"Document_No\":{\"0\":0,\"1\":1,\"2\":2,\"3\":3,\"4\":4,\"5\":5,\"6\":6,\"7\":7,\"8\":8,\"9\":9,\"10\":10,\"11\":11,\"12\":12,\"13\":13,\"14\":14,\"15\":15},\"Dominant_Topic\":{\"0\":4.0,\"1\":3.0,\"2\":0.0,\"3\":0.0,\"4\":3.0,\"5\":2.0,\"6\":2.0,\"7\":3.0,\"8\":0.0,\"9\":2.0,\"10\":1.0,\"11\":2.0,\"12\":1.0,\"13\":3.0,\"14\":0.0,\"15\":0.0},\"Topic_Perc_Contrib\":{\"0\":0.9897999763,\"1\":0.9958999753,\"2\":0.9764000177,\"3\":0.9768999815,\"4\":0.9901000261,\"5\":0.8838999867,\"6\":0.8855000138,\"7\":0.9844999909,\"8\":0.9467999935,\"9\":0.9858999848,\"10\":0.9951999784,\"11\":0.9677000046,\"12\":0.9811999798,\"13\":0.9616000056,\"14\":0.9821000099,\"15\":0.9836000204},\"Keywords\":{\"0\":\"item, credit, report, verify, experian, dispute, attach, letter, belong, follow\",\"1\":\"credit, tell, money, loan, contact, pay, go, work, payment, make\",\"2\":\"time, call, leave, ocwen, loan, ve, one, receive, payment, late\",\"3\":\"time, call, leave, ocwen, loan, ve, one, receive, payment, late\",\"4\":\"credit, tell, money, loan, contact, pay, go, work, payment, make\",\"5\":\"call, charge, contact, time, loan, company, agree, first, advise, close\",\"6\":\"call, charge, contact, time, loan, company, agree, first, advise, close\",\"7\":\"credit, tell, money, loan, contact, pay, go, work, payment, make\",\"8\":\"time, call, leave, ocwen, loan, ve, one, receive, payment, late\",\"9\":\"call, charge, contact, time, loan, company, agree, first, advise, close\",\"10\":\"credit, day, late, fargo, fee, wells, report, back, tell, contact\",\"11\":\"call, charge, contact, time, loan, company, agree, first, advise, close\",\"12\":\"credit, day, late, fargo, fee, wells, report, back, tell, contact\",\"13\":\"credit, tell, money, loan, contact, pay, go, work, payment, make\",\"14\":\"time, call, leave, ocwen, loan, ve, one, receive, payment, late\",\"15\":\"time, call, leave, ocwen, loan, ve, one, receive, payment, late\"},\"Text\":{\"0\":\"This is a complaint regarding items I disputed that does not belong to me. I thought according to law all credit bureaus investigate items on your credit that you are disputing the same. However, comparing my credit reports it shows different results. XXXX removed XXXX items that did not belong to me. But Experian stated, verified. How could that be? It seems that Experian waits and holds on to the dispute for 30 days w\\/o properly verifying and then after 30 days just say, it was verified w\\/o actually verifying. The following items is not mine listed below. \\r\\n\\r\\nXXXX ( XXXX ) XXXX XXXX ( XXXX ) I have attached a copy of my XXXX report, stating these XXXX items has been deleted. I would like Experian to follow suit and delete these XXXX items.I have attached the copy of my XXXX report so you can see the proof. \\r\\n\\r\\nAlso, I have a letter from XXXX on XXXX credit items that is reporting negatively on my credit report and XXXX informed the credit bureau to REMOVE the account and failed to do so. I have attached a letter for that as well. \\r\\n\\r\\nXXXX ( XXXX )\",\"1\":\"First contacted XXXX XXXX and XXXX XXXX XXXX in 2006 about daughter needing money to finish XXXX quarter. Before I signed as a cosigner on XXXX XXXX loan, I had a three way conversation with XXXX XXXX, the school and myself. Found out what she needed and expressed my wants to have the school paid directly with the monies, not to XXXX, XXXX XXXX Rep told me on the phone, it would be done. The following fall, XXXX my daughter did n't return to school, stated she did n't get enough financial help. Two years pass and I get a late notice on monthly payment, then I was told by her brother the reason of not returning to school was that she requested the loan to be sent to her after the original agreement and spent the monies. To verify that I call the financial aid dept. and they said that from the phone conversation in the beginning they waited on the funds but never got that check from XXXX XXXX as agreed. Since that time XXXX, because of being primary has put loan in forbearance, change email addresses for contact and not paid on the loan just to cause issues with me and my credit. I have take her to court 3 times, won the decision that she owes the money and she has told the judge 3 times she does n't owe it and spent the money and I owe it. Because of her owing money to everyone she does n't have anything in her name, just her husbands name. They have a new home, she drives a XXXX Chevrolet Tahoe, her husband works for XXXX, she bragged about how much money he makes and she works and gets paid cash so nothing shows up. She graduated from XXXX, and still pays this payment irregular so it messes up my credit. This last XXXX from what I was told when Navient, the new servicer contacted me in XXXX, she was 90 days late on the payment. They waited 90 days to contact me and it knock my credit rating down almost XXXX points to XXXX. XXXX does n't care because this is a game she plays knowingly that effects my credit because now since I had to retired, by monthly taxable income is {$190.00}. \\r\\nNavient calls me 3 to 4 times daily and sends me emails. When I talk to them and tell them that I cant afford to pay this amount and why do n't they contact her they say they have but contact me more because I am cosigner and then start making threat to me what they are going to do to me financially. XXXX does this to ruin my credit, I should have listen to my son back in 2006 and not signed this. I have tried to contact the Ombudsman department at Navient to resolve this but not response\",\"2\":\"On XXXX XXXX,2017 Equifax administration sent me a Retaliation and Discriminating response through CFPB Portal.\\r\\nCalling me Dear, XXXX XXXX. My name is not XXXX XXXX.My name is XXXX XXXX XXXX.\\r\\nWhy is Equifax Administration retaliating against me as a XXXX Military Veteran and my XXXX Lifetime?\\r\\nI filed complaint on XXXX XXXX,2017 Case file # XXXX.\\r\\nWhat 's Federal Government going to do against Equifax Retaliation and Discrimination against me as a Military Veteran?\",\"3\":\"I am called multiple times a day by different people in the office about my debt with them. I know I have this bebt but I am unemployed a d have been since   XXXX   XXXX  ,2017 and I have told them that several time. Their response is I 'm sorry that your not working but this debt has to be paid and until your account is current well will continue to call every 3 days or we will charge this account off as non-payment.\",\"4\":\"When I first went to XXXX XXXX in XXXX, MA, they had told me how they would place me in a job in that field. I completed in XXXX with a XXXX. That never helped me in obtaining a secure employment in that field. I ended up working for temp angencies. Then I became XXXX in XXXX and have been out of work since. My loans were through Sally Mae. They have been taking money out of my benefits since XXXX. I 'm should be getting $ XXXX mth but I actually only receive $ XXXX mth. I 'm a single parent trying to find a way to get back to work but it has been hard with my XXXX. I also tried to go back to the XXXX XXXX for my XXXX because they told me that they were now accredited and I would be able to transfer credits to XXXX XXXX XXXX. I went for about two weeks and just could n't make it to classes because of my XXXX. When I went to tell them this and needed to drop out. I was told that I would still have to pay. I am barely making ends meet with the income that I receive, I do n't need these loans huvering over my head. Especially when I 'm trying to get my credit straight as well. I want my loans to be Discharged.\",\"5\":\"I have contacted several times to advise the debt does not belong to me\",\"6\":\"Repeat calls and voice mail everyday. In the morning and after XXXX.\",\"7\":\"In 2014, I went to the XXXX Dealership to shop for a car, and they sent my credit report to several bank 's, which created multiple hard inquiries on my account. I did eventually purchase a car from them this summer, and specifically requested they would not send my information to several banks, as it seriously has set my credit score back. After reading about hard inquiries, I found that it may take up to two years for them to come off my credit report. This is frustrating me still, and my credit score is not improving by much, since the inquiries will not come off till XX\\/XX\\/XXXX.\",\"8\":\"In XXXX XXXX our daughter who was XXXX years old at the time had a XXXX within one week. She is know XXXX. My wife was forced to leave her job at the XXXX XXXX so she could take our daughter to multiple weekly appointments which continue today. Unfortunately the loss of her income did not leave us any choice but to file CHXXXX bankruptcy. The trustee made small monthly payments to OCWEN while we were under bankruptcy protection. Our case was discharged on XXXX XXXX XXXX. I have spoken with OCWEN several times over the past year and submitted paper work many times for a loan modification. Each time they said they never received all of the paperwork. My remaining balance with Ocwen is around {$100000.00}. I meet all of the criteria for a government loan modification yet they keep denying me. I have been forced to hire a law firm to protect my home. My current mortgage percentage rate is 9.2 %. If OCWEN would work with me and lower our interest rate and monthly payment, we could retain our home. Our home is the only thing my wife and I have and would expect OCWEN to follow federal guidelines and not give us the run around.\",\"9\":\"i got a automated call today XXXX\\/XXXX\\/XXXX from number XXXX & followed up with a call from XXXX XXXX XXXX XXXX, XXXX XXXX, XXXX i have no knowledge of this account and i have informed the agency that i have been a victim of identity theft, i did ot make any payday loans. \\r\\n\\r\\ni need copy of contract signed, iD presented, Store Location, video surveillance E.T.C. \\r\\n\\r\\nthis is an ID theft, i have not collected any such Loans & i want this collection and threats of lawsuit to stop now.. \\r\\n\\r\\nthis is the first call & first time i am hearing about this, claimed it was an account from XXXX, this is XXXX 5 years later. i am 100 % sure this is not my account and i need organization to close the account and delete records from my credit. \\r\\n\\r\\nThanks\",\"10\":\"Wells Fargo Financial has been reporting a negative \\\" LATE '' payment to all of the credit reporting agencies since XXXX of XXXX. During the month of XXXX XXXX I did n't receive that month 's bill ( not by email or US Mail ) somehow they forgot to send it to me that particular month in question. I just so happened to review an online statement that showed a Late Fee assessed to my account ( which was specialized account connected to a purchase from a company named XXXX XXXX and financed via Wells Fargo [ opened XXXX XXXX, XXXX ] in the form of a credit card account ) ; so I immediately contacted Wells Fargo XXXX XXXX XXXX and filed my initial complaint in efforts of reversing any possible damage to my credit and fee assessment. Okay, the fee was credited back to me and I was told that nothing was or will be reported to the major credit reporting companies ( not to worry ). Well the only truth to that statement, was that I was reimbursed the fee that was assessed ; but they to this day continue to report that I was 30 - 59 days late to all the credit reporting agencies. I even disputed this with Wells Fargo on a formal level and they still have n't changed anything. My argument is that I was given back any alleged late fees and told this would n't be reported ( they lied to me plain as day ). I frequent the app ' XXXX and to this day my FICO score is a little above XXXX - NEVER EVER BEEN LATE in paying back any of my creditors and was excused by Wells Fargo, yet they still plague me with a negative blemish that haunts me to this present day and that 's noted on my reports as the only damaging entry ( absent of that, I 'd have a PERFECT credit rating ) .... \\r\\n\\r\\n*This in my second time placing this complaint, I just completed this entire form and was at review - after reviewing it 's content, approved it then hit \\\" SUBMIT '' I got an system error message telling me to press the BACK button which erased my entire complaint content - I 'M XXXX ...\",\"11\":\"While I closed out my account a few weeks ago in regards to a late fee that was accessed to my account due to the automatic payments not coming out. I noticed that there was a charge to my account that I did not authorize. When I contacted the company I was advised that I agree to the charge. However I did not agree. The charge is fraudulent and I would like this company reprimanded.\",\"12\":\"I have XXXX violations from Ocwen Loan Servicing, first is a violation of the FDCPA in over contacting me ( 5 times in a 7 day period ) and I have been lied to when requesting to be able to pay my own homeoweners insurance and removing it from my escrow payment. \\r\\nThird, I have been viloated in my privacy under Graham Leach Bliley Act, when Ocwen without my permission contacted my insurance company and conducted business without my expressed written or verbal consent\",\"13\":\"I accidently made two mortgage payments in one month and CCO Mortgage refused to refund the additional payment. My position is that they received money from me that was not owed to them. They have no right to the money and should return it.\",\"14\":\"I 've had several instances. The first one was when I made a payment and navient decided to allocate funds from one of my loans on the other leaving me short on one of my loans causing me to get a late fee and a hassle to get them to fix it on there end. And I 've also experienced many times when they 've taken a smaller amount of funds for my loans leaving me with late fees. And because of these late withdrawals and leaving me short they 've increased my interest rates.\",\"15\":\"I did not receive corresponding documentation pertaining to what i owe or why I owe. Please provide the EOB date of services, medical bill charges, what was covered, how much money the insurer considers to be reasonable and customary, the amount that went towards your deductible, copay and how much money you might be responsible for. I have NEVER received any phone calls, emails, letters ( certified or regular ). I have XXXX people in the city of XXXX as well as XXXX, Texas with my name. I have continued to receive phone calls pertaining to him. I am not him. I am a XXXX.\"},\"Date\":{\"0\":\"7-21-2015\",\"1\":\"5-19-2016\",\"2\":\"12-26-2016\",\"3\":\"08-01-2017\",\"4\":\"2-24-2016\",\"5\":\"1-27-2016\",\"6\":\"9-26-2016\",\"7\":\"12-30-2015\",\"8\":\"8-28-2016\",\"9\":\"10-14-2016\",\"10\":\"7-30-2016\",\"11\":\"08-11-2017\",\"12\":\"08-03-2015\",\"13\":\"3-25-2015\",\"14\":\"1-29-2017\",\"15\":\"9-26-2015\"}}"}, "Federal bank": {"df_top3words": "{\"topic_id\":{\"0\":0,\"1\":1,\"2\":2,\"3\":3,\"4\":4},\"words\":{\"0\":\"xx\\/2015, \\ncall, \\ntell\",\"1\":\"even, \\nletter, \\ntime\",\"2\":\"money, \\nbalance, \\nupdate\",\"3\":\"dispute, \\ncomputer, \\ncharge\",\"4\":\"dispute, \\nhelp, \\ncharge\"}}", "tsne_df": "{\"tsne_x\":{\"0\":107.3597869873,\"1\":16.9541740417,\"2\":69.2002029419,\"3\":55.1137161255},\"tsne_y\":{\"0\":48.853969574,\"1\":62.9400291443,\"2\":101.1001052856,\"3\":10.6936101913},\"topic_num\":{\"0\":0,\"1\":0,\"2\":0,\"3\":0},\"doc_num\":{\"0\":0,\"1\":1,\"2\":2,\"3\":3}}", "df_dominant_topic": "{\"Document_No\":{\"0\":0,\"1\":1,\"2\":2,\"3\":3},\"Dominant_Topic\":{\"0\":2.0,\"1\":3.0,\"2\":0.0,\"3\":3.0},\"Topic_Perc_Contrib\":{\"0\":0.9757000208,\"1\":0.9825999737,\"2\":0.9578999877,\"3\":0.989199996},\"Keywords\":{\"0\":\"money, balance, update, take, time, card, need, reflect, hit, state\",\"1\":\"dispute, computer, charge, help, previously, chase, letter, know, m, agency\",\"2\":\"xx\\/2015, call, tell, debt, make, onxx, citibank, speak, 21, home\",\"3\":\"dispute, computer, charge, help, previously, chase, letter, know, m, agency\"},\"Text\":{\"0\":\"I was advised by rushcard of an update on XX\\/XX\\/XXXX between XXXX and XXXX XXXX. At XXXX XXXX that day i got an email stating it was taking longer than expected but would be up at XXXX. At that time, i was able to use my card, however my balance was not updating. my direct deposit was scheduled to hit both tuesday and wednesday, my balance still does not reflect that. i have no money to pay my rent, or feed my daughter. i need my money ASAP\",\"1\":\"My loan is in default, I have been trying to establish an Income based repayment plan with Delta Collection Agency @ XXXX. I 'm frustrated by their delaying tactics. I have sent in all requested documents even three years of tax returns, reference letters, Hardship letter yet every time I call something is missing, even though a supervisor told me yesterday everything was their. I have the opportunity to restart school but need my XXXX in place first.\",\"2\":\"Citibank continues to make calls to my home concerning a debt for XXXX XXXX. We have told told them onXX\\/XX\\/2015, XX\\/XX\\/2015 XX\\/XX\\/2015, a total of 21 calls, speaking to a XXXX and XXXX this is not our debt\",\"3\":\"I am writing to your agency in hopes you can help me with some charges on m y Chase Card  previously disputed with you guys. I would like to know the status of the disputes. I am  XXXX  and I do not own a computer, no electricity or internet and I am not computer literate . Communication is k ind of difficult sometimes. So I asked my friend to help me with this. I did a complaint with CFPB previously but I lost track on what happened with my disputes. I was naive and let some companies take advantage of me and charged me for online services, meanwhile I told them I didnt own a computer, they said it wouldnt be a problem they would do all the work for me, and they did disappeared after, I tried to contact them many times to see what was going on, and they were not capable of fulfill with their end of the deal. I would like to know if the charges that I disputed with Chase were ever investigated and if they did what were the results. If they were disputed as claim and defenses. I would really appreciate if you help me with this so I can get some closure please.\"},\"Date\":{\"0\":\"10-20-2015\",\"1\":\"5-24-2016\",\"2\":\"11-08-2015\",\"3\":\"4-26-2017\"}}"}, "ICICI bank": {"df_top3words": "{\"topic_id\":{\"0\":0,\"1\":1,\"2\":2,\"3\":3,\"4\":4},\"words\":{\"0\":\"call, \\nletter, \\nstill\",\"1\":\"letter, \\nrespond, \\ncall\",\"2\":\"debt, \\ncredit, \\nvalidation\",\"3\":\"debt, \\ncredit, \\nvalidation\",\"4\":\"debt, \\ntexas, \\nvalidation\"}}", "tsne_df": "{\"tsne_x\":{\"0\":312.2153320312,\"1\":402.0219726562,\"2\":155.2908935547,\"3\":558.9464111328},\"tsne_y\":{\"0\":70.7368164062,\"1\":-332.9184265137,\"2\":-175.9941558838,\"3\":-86.1874465942},\"topic_num\":{\"0\":0,\"1\":0,\"2\":0,\"3\":1},\"doc_num\":{\"0\":0,\"1\":1,\"2\":2,\"3\":3}}", "df_dominant_topic": "{\"Document_No\":{\"0\":0,\"1\":1,\"2\":2,\"3\":3},\"Dominant_Topic\":{\"0\":3.0,\"1\":4.0,\"2\":3.0,\"3\":1.0},\"Topic_Perc_Contrib\":{\"0\":0.9650999904,\"1\":0.9843000174,\"2\":0.9875000119,\"3\":0.9466000199},\"Keywords\":{\"0\":\"debt, credit, validation, report, show, still, provide, tell, file, verify\",\"1\":\"debt, texas, validation, credit, request, receive, receipt, report, finance, still\",\"2\":\"debt, credit, validation, report, show, still, provide, tell, file, verify\",\"3\":\"letter, respond, call, place, incorrect, monthly, email, excessive, charge, will\"},\"Text\":{\"0\":\"Was late on auto payment but now I am current. Finance company still showing I 'm 2 months behind. Called to question why it was still showing me as in arrears but was provided with an answer. Was told they could n't help me\",\"1\":\"I am a resident of the state of Texas and sent National Credit Systems a Texas Debt Validation request in accordance with Texas Finance Code 392.202. This request was received and signed for on XXXX\\/XXXX\\/2015. I have not received validation of this debt. It has now been well past the 30 day period in which the agency must respond. I recently checked my credit reports and this debt still remains. I have attached a copy of the Texas Debt Validation Letter, Certified Mail Receipt, and Return Receipt.\",\"2\":\"I have filed a validation dispute with XXXX, Equifax and XXXX regarding Bankruptcies that are listed on my credit report. After filing a validation dispute requesting proof that this debt belonged to me, I received a letter in the mail stating that this debt was confirmed and is said to be my debt. I then contacted the Bankruptcy courts who then advised that they do NOT confirm any debts with the credit bureaus. I would like to know exactly who or how they verify debts for any individual, without proper documentations. I also requested a second validation and was told that I would need to provide additional proof to validate any information on my credit report. I would like this information removed from my credit report because the Bankruptcies were never verified and the credit bureaus are lying to the consumers.\",\"3\":\"CareCredit\\/Synchrony Bank has placed an excessive incorrect monthly interest charge on my account and will not respond to my letters, calls, or emails.\"},\"Date\":{\"0\":\"6-21-2016\",\"1\":\"07-04-2015\",\"2\":\"11-20-2016\",\"3\":\"6-15-2015\"}}"}}